{
 "2.0": {
  "meta": {
   "description": "The mime-types library provides a library and registry for information about MIME content type definitions",
   "homepage": "http://mime-types.rubyforge.org/",
   "license": null,
   "long_description": "The mime-types library provides a library and registry for information about\nMIME content type definitions. It can be used to determine defined filename\nextensions for MIME types, or to use filename extensions to look up the likely\nMIME type definitions.\n\nMIME content types are used in MIME-compliant communications, as in e-mail or\nHTTP traffic, to indicate the type of content which is transmitted. The\nmime-types library provides the ability for detailed information about MIME\nentities (provided as an enumerable collection of MIME::Type objects) to be\ndetermined and used programmatically. There are many types defined by RFCs and\nvendors, so the list is long but by definition incomplete; don't hesitate to to\nadd additional type definitions (see Contributing.rdoc). The primary sources\nfor MIME type definitions found in mime-types is the IANA collection of\nregistrations (see below for the link), RFCs, and W3C recommendations.\n\nThe mime-types library uses semantic versioning. This is release 2.0; there are\nincompatible changes in the API provided by mime-types, mostly around registry\ninitialization (see History.rdoc for full details), and the removal of support\nfor Ruby 1.8 interpreters.\n\nmime-types (previously called MIME::Types for Ruby) was originally based on\nMIME::Types for Perl by Mark Overmeer, copyright 2001 - 2009. It is built to\nconform to the MIME types of RFCs 2045 and 2231. It tracks the {IANA\nregistry}[http://www.iana.org/assignments/media-types/]\n({ftp}[ftp://ftp.iana.org/assignments/media-types]) with some unofficial types\nadded from the {LTSW collection}[http://www.ltsw.se/knbase/internet/mime.htp]\nand added by the users of mime-types.",
   "maintainers": [],
   "name": "ruby-mime-types",
   "platforms": null,
   "position": "pkgs/development/interpreters/ruby/generated.nix:1365"
  },
  "revs": [
   "0008a4b6c467977469b9b3bdec15fcc580204145",
   "2c09066dfd1e9f332603993829e128a0261e9840"
  ]
 }
}