{
 "3.1.10": {
  "meta": {
   "description": "A content management platform built using the Django framework\n",
   "homepage": "http://mezzanine.jupo.org/",
   "license": {
    "fullName": "Unspecified free software license",
    "shortName": "free"
   },
   "long_description": "Mezzanine is a powerful, consistent, and flexible content management\nplatform. Built using the Django framework, Mezzanine provides a\nsimple yet highly extensible architecture that encourages diving in and\nhacking on the code. Mezzanine is BSD licensed and supported by a\ndiverse and active community.\n\nIn some ways, Mezzanine resembles tools such as Wordpress that provide\nan intuitive interface for managing pages, blog posts, form data, store\nproducts, and other types of content. But Mezzanine is also different.\nUnlike many other platforms that make extensive use of modules or\nreusable applications, Mezzanine provides most of its functionality by\ndefault. This approach yields a more integrated and efficient platform.\n",
   "maintainers": [
    {
     "email": "pavan.rikhi@gmail.com",
     "github": "prikhi",
     "name": "Pavan Rikhi"
    }
   ],
   "name": "python3.6-mezzanine",
   "platforms": [
    {
     "kernel": {
      "_type": "kernel",
      "execFormat": {
       "_type": "exec-format",
       "name": "elf"
      },
      "families": {},
      "name": "linux"
     }
    }
   ],
   "position": "pkgs/top-level/python-packages.nix:7601"
  },
  "revs": [
   "000482ffc470f798fb3aa1673b39a38680cbb567",
   "3e1be2206b4c1eb3299fb633b8ce9f5ac1c32898"
  ]
 },
 "4.3.1": {
  "meta": {
   "description": "A content management platform built using the Django framework\n",
   "homepage": "http://mezzanine.jupo.org/",
   "license": {
    "fullName": "Unspecified free software license",
    "shortName": "free"
   },
   "long_description": "Mezzanine is a powerful, consistent, and flexible content\nmanagement platform. Built using the Django framework, Mezzanine\nprovides a simple yet highly extensible architecture that\nencourages diving in and hacking on the code. Mezzanine is BSD\nlicensed and supported by a diverse and active community.\n\nIn some ways, Mezzanine resembles tools such as Wordpress that\nprovide an intuitive interface for managing pages, blog posts,\nform data, store products, and other types of content. But\nMezzanine is also different.  Unlike many other platforms that\nmake extensive use of modules or reusable applications,\nMezzanine provides most of its functionality by default. This\napproach yields a more integrated and efficient platform.\n",
   "maintainers": [
    {
     "email": "pavan.rikhi@gmail.com",
     "github": "prikhi",
     "name": "Pavan Rikhi"
    }
   ],
   "name": "python3.6-Mezzanine",
   "platforms": [
    {
     "kernel": {
      "_type": "kernel",
      "execFormat": {
       "_type": "exec-format",
       "name": "elf"
      },
      "families": {},
      "name": "linux"
     }
    }
   ],
   "position": "pkgs/development/python-modules/mezzanine/default.nix:45"
  },
  "revs": [
   "0013bc3056604b25299e8601caf4f99cc1f4a910",
   "3633b3271dfc644acc63b062feb4f95e88054c42"
  ]
 }
}